Repository: robertcrockett/azuredatastudio_1_8
Catalog: resources/xlf/vscode-extensions/big-data-cluster.*.xlf
Languages: es, fr, ja, pt_br, ru

# bigDataClusterOutputChannel
source: SQL Server big data cluster
es: Clúster de macrodatos de SQL Server
fr: Cluster SQL Server Big Data
ja: SQL Server のビッグ データ クラスター
pt_br: Cluster de Big Data do SQL Server
ru: Кластер больших данных SQL Server

# runKubectlFailed
source: Unable to run kubectl
es: No se puede ejecutar kubectl
fr: Impossible d'exécuter kubectl
ja: Kubectl を実行できません
pt_br: Não é possível executar kubectl
ru: Не удалось запустить kubectl

# setClusterFailed
source: Failed to set '{0}' as current cluster: {1}
es: No se pudo establecer "{0}" como clúster actual: {1}
fr: Échec de la définition de '{0}' comme cluster actuel : {1}
ja: '{0}' を現在のクラスターとして設定できませんでした: {1}
pt_br: Falha ao definir '{0}' como cluster atual: {1}
ru: Не удалось установить "{0}" в качестве текущего кластера: {1}

# binaryNotFound
source: Could not find {0} binary. {1}
es: No se encuentra el archivo binario {0}. {1}
fr: Fichier binaire {0} introuvable. {1}
ja: {0} バイナリが見つかりませんでした。{1}
pt_br: Não foi possível encontrar {0} binário. {1}
ru: Не удалось найти двоичный объект {0}. {1}

# binaryNotInstalled
source: {0} is not installed. {1}
es: {0} no está instalado. {1}
fr: {0} n'est pas installé. {1}
ja: {0} がインストールされていません。{1}
pt_br: {0} não está instalado. {1}
ru: {0} не установлен. {1}

# kubernetesRequired
source: SQL Server Big data cluster requires kubernetes.
es: El clúster de macrodatos de SQL Server requiere kubernetes.
fr: Le cluster SQL Server Big Data nécessite kubernetes.
ja: SQL Server のビッグ データ クラスターには kubernetes が必要です。
pt_br: O cluster de Big Data do SQL Server requer o kubernetes.
ru: Кластеру больших данных SQL Server требуется Kubernetes.

# cannotExecuteCmd
source: Cannot execute command.
es: No se puede ejecutar el comando.
fr: Impossible d'exécuter la commande.
ja: コマンドを実行できません。
pt_br: Não é possível executar o comando.
ru: Не удается выполнить команду.

# kubectlVersionIncompatible
source: kubectl version ${0} may be incompatible with cluster Kubernetes version {1}
es: La versión ${0} de kubectl puede ser incompatible con la versión {1} de Kubernetes
fr: kubectl version ${0} est peut-être incompatible avec le cluster Kubernetes version {1}
ja: kubectl バージョン ${0} がクラスター Kubernetes バージョン {1} と互換性がない可能性があります
pt_br: A versão kubectl ${0} pode ser incompatível com a versão {1} do cluster Kubernetes
ru: Версия kubectl ${0} может быть несовместима с версией кластера Kubernetes {1}

# cannotRunCommand
source: Unable to run command ({0})
es: No se puede ejecutar el comando ({0})
fr: Impossible d'exécuter la commande ({0})
ja: コマンド ({0}) を実行できません
pt_br: Não é possível executar o comando ({0})
ru: Не удалось выполнить команду ({0})

# installDependenciesAction
source: Install dependencies
es: Instalar dependencias
fr: Installer les dépendances
ja: 依存関係をインストールします
pt_br: Instalar dependências
ru: Установить зависимости

# learnMoreAction
source: Learn more
es: Más información
fr: En savoir plus
ja: 詳細を表示
pt_br: Saiba mais
ru: Дополнительные сведения

# moreInfoMsg
source: Add {0} directory to path, or set "mssql-bdc.{0}-path" config to {0} binary.
es: Agregue el directorio {0} a la ruta de acceso o establezca "mssql-bdc.{0}-path" en el valor binario {0}.
fr: Ajoutez le répertoire {0} au chemin ou définissez la configuration "mssql-bdc.{0}-path" sur le fichier binaire {0}.
ja: {0} ディレクトリをパスに追加するか、"mssql-bdc.{0}-path" 構成を {0} バイナリに設定します。
pt_br: Adicione o diretório {0} ao caminho ou defina a configuração "mssql-bdc.{0}-path" para o binário {0}.
ru: Добавьте каталог {0} в путь или задайте для конфигурации "mssql-bdc.{0}-path" двоичный объект {0}.

# downloadKubectlFailed
source: Failed to download kubectl: {0}
es: No se pudo descargar kubectl: {0}
fr: Le téléchargement de kubectl a échoué : {0}
ja: Kubectl をダウンロードできませんでした: {0}
pt_br: Falha ao baixar kubectl: {0}
ru: Не удалось скачать kubectl: {0}

# kubectlVersionCheckFailed
source: Failed to establish kubectl stable version: {0}
es: No se pudo establecer la versión estable de kubectl: {0}
fr: L'établissement d'une version stable de kubectl a échoué : {0}
ja: kubectl 安定版を設定できませんでした: {0}
pt_br: Falha ao estabelecer a versão estável do kubectl: {0}
ru: Не удалось установить стабильную версию kubectl: {0}

source: Done
es: hecho
fr: terminé
ja: 完了
pt_br: concluído
ru: Договорились

# dependencyInstalled
source: {0} already installed...
es: {0} ya está instalado...
fr: {0} déjà installé...
ja: {0} は既にインストールされています...
pt_br: {0} já instalado...
ru: {0} уже установлен...

# installingDependency
source: Installing {0}...
es: Instalando [0]...
fr: Installation de {0}...
ja: {0} をインストールしています...
pt_br: Instalando {0}...
ru: Идет установка {0}...

# installingDependencyFailed
source: Unable to install {0}: {1}
es: No se puede instalar {0}: {1}
fr: Impossible d'installer {0} : {1}
ja: {0} をインストールできませんでした: {1}
pt_br: Não é possível instalar {0}: {1}
ru: Не удалось установить {0}: {1}
