Repository: robertcrockett/azuredatastudio_1_8
Catalog: resources/xlf/vscode-extensions/big-data-cluster.*.xlf
Languages: es, fr, ja, pt_br, ru

# bdc-create.summaryPageTitle
source: Summary
es: Resumen
fr: Récapitulatif
ja: 概要
pt_br: Resumo
ru: Сводка

# bdc-create.TargetClusterTypeText
source: Cluster type
es: Tipo de clúster
fr: Type de cluster
ja: クラスターの種類
pt_br: Tipo de cluster
ru: Тип кластера

# bdc-create.ClusterContextText
source: Cluster context
es: Contexto del clúster
fr: Contexte de cluster
ja: クラスター コンテキスト
pt_br: Contexto de cluster
ru: Контекст кластера

# bdc-create.ClusterNameText
source: Cluster name
es: Nombre del clúster
fr: Nom du cluster
ja: クラスター名
pt_br: Nome do cluster
ru: Имя кластера

# bdc-create.ClusterAdminUsernameText
source: Cluster Admin username
es: Nombre de usuario del administrador del clúster
fr: Nom d'utilisateur administrateur du cluster
ja: クラスター管理者ユーザー名
pt_br: Nome de usuário do administrador de cluster
ru: Имя пользователя для администратора кластера

# bdc-create.AcceptEulaText
source: Accept license agreement
es: Acepte el contrato de licencia
fr: Accepter le contrat de licence
ja: 使用許諾契約書に同意します
pt_br: Aceitar o contrato de licença
ru: Примите лицензионное соглашение

# bdc-create.DeploymentProfileText
source: Deployment profile
es: Perfil de implementación
fr: Profil de déploiement
ja: 展開プロファイル
pt_br: Perfil de implantação
ru: Профиль развертывания

# bdc-create.SqlServerMasterScaleText
source: SQL Server master scale
es: Escala maestra de SQL Server
fr: Mise à l'échelle du serveur maître SQL Server
ja: SQL Server マスターのスケール
pt_br: Escala de mestre do SQL Server
ru: Масштабирование базы данных master SQL Server

# bdc-create.ComputePoolScaleText
source: Compute pool scale
es: Calcular la escala del grupo
fr: Mise à l'échelle du pool de calcul
ja: コンピューティング プールのスケール
pt_br: Escala do pool de computação
ru: Масштабирование пула вычислительных ресурсов

# bdc-create.DataPoolScaleText
source: Data pool scale
es: Escala del grupo de datos
fr: Mise à l'échelle du pool de données
ja: データ プールのスケール
pt_br: Escala do pool de dados
ru: Масштабирование пула данных

# bdc-create.StoragePoolScaleText
source: Storage pool scale
es: Escala del grupo de almacenamiento
fr: Mise à l'échelle du pool de stockage
ja: 記憶域プールのスケール
pt_br: Escala de pool de armazenamento
ru: Масштабирование пула носителей

# bdc-create.SparkPoolScaleText
source: Spark pool scale
es: Escala del grupo de Spark
fr: Mise à l'échelle du pool Spark
ja: スパーク プールのスケール
pt_br: Escala de pool do Spark
ru: Масштабирование пула Spark

# bdc-create.TargetClusterGroupTitle
source: TARGET CLUSTER
es: CLÚSTER DE DESTINO
fr: CLUSTER CIBLE
ja: ターゲット クラスター
pt_br: CLUSTER DE DESTINO
ru: ЦЕЛЕВОЙ КЛАСТЕР

# bdc-create.BigDataClusterGroupTitle
source: SQL SERVER BIG DATA CLUSTER
es: CLÚSTER DE MACRODATOS DE SQL SERVER
fr: CLUSTER SQL SERVER BIG DATA
ja: SQL Server のビッグ データ クラスター
pt_br: CLUSTER DE BIG DATA DO SQL SERVER
ru: КЛАСТЕР БОЛЬШИХ ДАННЫХ SQL SERVER

# bdc-create.YesText
source: Yes
es: Sí
fr: Oui
ja: はい
pt_br: Sim
ru: Да

# bdc-create.RestoreDefaultValuesText
source: Restore Default Values
es: Restaurar valores predeterminados
fr: Restaurer les valeurs par défaut
ja: 既定値に戻す
pt_br: Restaurar os valores padrão
ru: Восстановить значения по умолчанию

# bdc-create.settingsPageTitle
source: Settings
es: Configuración
fr: Paramètres
ja: 設定
pt_br: Configurações
ru: Параметры

# bdc-create.settingsPageDescription
source: Configure the settings required for deploying SQL Server big data cluster
es: Configure los valores necesarios para la implementación del clúster de macrodatos de SQL Server
fr: Configurer les paramètres obligatoires pour déployer le cluster SQL Server Big Data
ja: SQL Server のビッグ データ クラスターを展開するために必要な設定を構成します
pt_br: Configurar as definições necessárias para a implantação de cluster de Big Data do SQL Server
ru: Настройте параметры, необходимые для развертывания кластера больших данных SQL Server

# bdc-create.EulaNotAccepted
source: You need to accept the terms of services and privacy policy in order to proceed
es: Debe aceptar los términos de servicio y la directiva de privacidad para poder continuar
fr: Vous devez accepter les conditions des services et la politique de confidentialité pour continuer
ja: 続行するにはサービス利用規約とプライバシー ポリシーに同意する必要があります
pt_br: Você precisa aceitar os termos de serviços e a política de privacidade para prosseguir
ru: Для продолжения вам нужно принять условия обслуживания и политику конфиденциальности

# bdc-create.ClusterName
source: Cluster name
es: Nombre del clúster
fr: Nom du cluster
ja: クラスター名
pt_br: Nome do cluster
ru: Имя кластера

# bdc-create.AdminUsernameText
source: Admin username
es: Nombre de usuario del administrador
fr: Nom d'utilisateur administrateur
ja: 管理者ユーザー名
pt_br: Nome de usuário admin
ru: Имя пользователя администратора

# bdc-create.AdminUserPasswordText
source: Password
es: Contraseña
fr: Mot de passe
ja: パスワード
pt_br: Senha
ru: Пароль

# bdc-create.SQLPortText
source: SQL Server master
es: Servidor SQL Server maestro
fr: Serveur maître SQL Server
ja: SQL Server マスター
pt_br: Mestre do SQL Server
ru: База данных master SQL Server

# bdc-create.ControllerPortText
source: Controller
es: Controlador
fr: Contrôleur
ja: コントローラー
pt_br: Controlador
ru: Контроллер

# bdc-create.ProxyPortText
source: Proxy
ja: プロキシ
ru: Прокси-сервер

# bdc-create.GrafanaPortText
source: Grafana dashboard
es: Panel Grafana
fr: Tableau de bord Grafana
ja: Grafana ダッシュボード
pt_br: Painel do Grafana
ru: Панель мониторинга Grafana

# bdc-create.KibanaPortText
source: Kibana dashboard
es: Panel Kibana
fr: Tableau de bord Kibana
ja: Kibana ダッシュボード
pt_br: Painel do Kibana
ru: Панель мониторинга Kibana

# bdc-create.RegistryUserNamePasswordHintText
source: only required for private registries
es: solo se requiere para registros privados
fr: obligatoire seulement pour les registres privés
ja: プライベート レジストリの場合のみ必須
pt_br: necessário apenas para registros privados
ru: требуется только для частных реестров

# bdc-create.RegistryText
source: Registry
es: Registro
fr: Registre
ja: レジストリ
pt_br: Registro
ru: Реестр

# bdc-create.RepositoryText
source: Repository
es: Repositorio
fr: Dépôt
ja: リポジトリ
pt_br: Repositório
ru: Репозиторий

# bdc-create.ImageTagText
source: Image tag
es: Etiqueta de imagen
fr: Balise d'image
ja: イメージ タグ
pt_br: Tag de imagem
ru: Тег изображения

# bdc-create.RegistryUserNameText
source: Username
es: Nombre de usuario
fr: Nom d'utilisateur
ja: ユーザー名
pt_br: Nome do Usuário
ru: Имя пользователя

# bdc-create.RegistryPasswordText
source: Password
es: Contraseña
fr: Mot de passe
ja: パスワード
pt_br: Senha
ru: Пароль

# bdc-create.BasicSettingsText
source: Basic Settings
es: Configuración básica
fr: Paramètres de base
ja: 基本的な設定
pt_br: Configurações básicas
ru: Основные параметры

# bdc-create.ContainerRegistrySettings
source: Container Registry Settings
es: Configuración de Container Registry
fr: Paramètres Container Registry
ja: コンテナー レジストリの設定
pt_br: Configurações de Registro de Contêiner
ru: Параметры реестра контейнеров

# bdc-create.PortSettings
source: Port Settings (Optional)
es: Configuración de puerto (opcional)
fr: Paramètres de port (facultatif)
ja: ポートの設定 (省略可能)
pt_br: Configurações de porta (opcional)
ru: Параметры порта (необязательно)

# bdc-create.LicenseTerms
source: license terms
es: términos de la licencia
fr: termes du contrat de licence
ja: ライセンス条項
pt_br: termos de licença
ru: условия лицензионного соглашения

# bdc-create.PrivacyPolicyText
source: privacy policy
es: directiva de privacidad
fr: politique de confidentialité
ja: プライバシー ポリシー
pt_br: política de privacidade
ru: Политика конфиденциальности

# bdc-create.AcceptTermsText
source: I accept the {0} and {1}.
es: Acepto los {0} y la {1}.
fr: J'accepte les {0} et la {1}.
ja: {0} および {1} に同意します。
pt_br: Eu aceito o {0} e o {1}.
ru: Я принимаю {0} и {1}.

# bdc-create.InstallToolsText
source: Install Tools
es: Instalar herramientas
fr: Installer les outils
ja: ツールのインストール
pt_br: Instalar Ferramentas
ru: Установить средства

# bdc-create.InstallingButtonText
source: Installing...
es: Instalando...
fr: Installation...
ja: インストールしています...
pt_br: Instalando...
ru: Установка...

# bdc-create.selectTargetClusterTypePageTitle
source: What is your target cluster environment?
es: ¿Cuál es el entorno de clúster de destino?
fr: Quel est votre environnement de cluster cible ?
ja: ターゲット クラスター環境は何ですか。
pt_br: Qual é o seu ambiente de cluster de destino?
ru: Что является вашей целевой средой кластера?

# bdc-create.selectTargetClusterTypePageDescription
source: Choose the target environment and then install the required tools for it.
es: Elija el entorno de destino y, después, instale las herramientas necesarias para ello.
fr: Choisissez l'environnement cible, puis installez les outils obligatoires appropriés.
ja: ターゲット環境を選択し、その環境に必要なツールをインストールします。
pt_br: Escolha o ambiente de destino e depois instale as ferramentas necessárias para ele.
ru: Выберите целевую среду и установите для нее необходимые средства.

# bdc-create.RefreshToolsButtonText
source: Refresh Status
es: Actualizar estado
fr: Actualiser l'état
ja: 状態の更新
pt_br: Atualizar Status
ru: Обновить состояние

# bdc-create.toolNameColumnHeader
source: Tool
es: Herramienta
fr: Outil
ja: ツール
pt_br: Ferramenta
ru: Инструмент

# bdc-create.toolDescriptionColumnHeader
source: Description
es: Descripción
ja: 説明
pt_br: Descrição
ru: Описание

# bdc-create.toolVersionColumnHeader
source: Version
es: Versión
ja: バージョン
pt_br: Versão
ru: Версия

# bdc-create.toolStatusColumnHeader
source: Status
es: Estado
fr: État
ja: 状態
ru: Статус

# bdc-create.PickTargetEnvironmentText
source: Pick target environment
es: Elegir el entorno de destino
fr: Choisir l'environnement cible
ja: ターゲット環境の選択
pt_br: Escolher o ambiente de destino
ru: Выберите целевую среду

# bdc-create.ToolsRefreshingText
source: Please wait while the required tools status is being refreshed.
es: Espere mientras se se actualiza el estado de las herramientas necesarias.
fr: Veuillez patienter pendant l'actualisation de l'état des outils obligatoires.
ja: 必要なツールの状態が更新されるまでお待ちください。
pt_br: Aguarde enquanto o status das ferramentas necessárias está sendo atualizado.
ru: Подождите, пока обновляется состояние необходимых средств.

# bdc-create.TargetClusterTypeNotSelectedText
source: Please select a target cluster type.
es: Seleccione un tipo de clúster de destino.
fr: Sélectionnez un type de cluster cible.
ja: ターゲット クラスターの種類を選択してください。
pt_br: Selecione um tipo de cluster de destino.
ru: Выберите тип целевого кластера.

# bdc-create.MissingToolsText
source: Please install the required tools.
es: Instale las herramientas necesarias.
fr: Installez les outils obligatoires.
ja: 必要なツールをインストールしてください。
pt_br: Instale as ferramentas necessárias.
ru: Установите необходимые инструменты.

# bdc-create.ComingSoonText
source: (Coming Soon)
es: (próximamente)
fr: (Bientôt disponible)
ja: (近日公開予定)
pt_br: (Em breve)
ru: (Скоро)

# bdc-create.RequiredToolsText
source: Required tools
es: Herramientas necesarias
fr: Outils obligatoires
ja: 必要なツール
pt_br: Ferramentas necessárias
ru: Необходимые инструменты

# bdc-create.InstalledText
source: Installed
es: INSTALADO
fr: INSTALLÉ
ja: インストール済み
pt_br: INSTALADO
ru: УСТАНОВЛЕН

# bdc-create.NotInstalledText
source: Not Installed
es: No instalado
fr: Non installé
ja: インストールされていません
pt_br: Não instalado
ru: Не установлено

# bdc-create.InstallingText
source: Installing...
es: Instalando...
fr: Installation...
ja: インストールしています...
pt_br: Instalando...
ru: Установка...

# bdc-create.FailedToInstallText
source: Install Failed
es: No se pudo instalar
fr: Échec de l'installation
ja: インストールに失敗しました
pt_br: Falha na instalação
ru: Сбой установки

# bdc-create.selectTargetClusterPageTitle
source: Where do you want to deploy this SQL Server big data cluster?
es: ¿Dónde desea implementar este clúster de macrodatos de SQL Server?
fr: Où voulez-vous déployer ce cluster SQL Server Big Data ?
ja: この SQL Server のビッグ データ クラスターをどこに展開しますか?
pt_br: Onde você quer implantar este cluster de Big Data do SQL Server?
ru: Где вы хотите развернуть этот кластер больших данных SQL Server?

# bdc-create.selectTargetClusterPageDescription
source: Select the kubeconfig file and then select a cluster context from the list
es: Seleccione el archivo kubeconfig y un contexto de clúster en la lista
fr: Sélectionner le fichier kubeconfig, puis un contexte de cluster dans la liste
ja: Kubeconfig ファイルを選択し、リストからクラスター コンテキストを選択します
pt_br: Selecione o arquivo kubeconfig e, em seguida, selecione um contexto de cluster na lista
ru: Выберите файл kubeconfig и затем выберите контекст кластера в списке

# bdc-create.ClusterContextNotSelectedMessage
source: Please select a cluster context.
es: Seleccione un contexto de clúster.
fr: Sélectionnez un contexte de cluster.
ja: クラスター コンテキストを選択してください。
pt_br: Selecione um contexto de cluster.
ru: Выберите контекст кластера.

# bdc-create.kubeConfigFileLabelText
source: Kube config file path
es: Ruta de acceso al archivo de configuración de Kube
fr: Chemin du fichier config de Kube
ja: Kube 構成のファイル パス
pt_br: Caminho do arquivo de configuração Kube
ru: Путь к файлу kube config

# bdc-browseText
source: Browse
es: Examinar
fr: Parcourir
ja: 参照
pt_br: Procurar
ru: Обзор

# bdc-clusterContextsLabelText
source: Cluster Contexts
es: Contextos de clúster
fr: Contextes de cluster
ja: クラスター コンテキスト
pt_br: Contextos de cluster
ru: Контексты кластера

# bdc-errorLoadingClustersText
source: No cluster information is found in the config file or an error ocurred while loading the config file
es: No se ha encontrado información de clúster en el archivo de configuración o se ha producido un error al cargar este archivo
fr: Aucune information de cluster dans le fichier config ou une erreur s'est produite pendant le chargement du fichier config
ja: 構成ファイルにクラスター情報が見つからないか、構成ファイルの読み込み中にエラーが発生しました
pt_br: Informações de cluster não encontradas no arquivo de configuração ou ocorreu um erro ao carregar o arquivo de configuração
ru: Не найдены сведения о кластере в файле конфигурации, либо при загрузке этого файла произошла ошибка

# bdc-selectKubeConfigFileText
source: Select
es: Seleccionar
fr: Sélectionner
ja: 選択
pt_br: Selecione
ru: Выбрать

# bdc-create.clusterProfilePageTitle
source: Select a cluster profile
es: Seleccione un perfil de clúster
fr: Sélectionner un profil de cluster
ja: クラスター プロファイルを選択します
pt_br: Selecione um perfil de cluster
ru: Выберите профиль кластера

# bdc-create.clusterProfilePageDescription
source: Select your requirement and we will provide you a pre-defined default scaling. You can later go to cluster configuration and customize it.
es: Seleccione lo que necesita y nosotros le proporcionaremos un escalado predeterminado predefinido. Después, puede ir a la configuración del clúster y personalizarlo.
fr: Sélectionnez votre exigence et nous vous fournissons une mise à l'échelle par défaut prédéfinie. Vous pouvez ensuite accéder à la configuration du cluster et la personnaliser.
ja: 要件を選択します。事前定義された既定のスケーリングが提供されます。後ほどクラスター構成に移動し、カスタマイズできます。
pt_br: Selecione seu requisito e lhe forneceremos um padrão pré-definido de dimensionamento. Mais tarde, você poderá ir para a configuração de cluster e personalizá-lo.
ru: Выберите требование, и мы предоставим предопределенное масштабирование по умолчанию. Позднее вы можете перейти в конфигурацию кластера и настроить его.

# bdc-create.TargetClusterOverview
source: Target cluster scale overview
es: Información general de la escala del clúster de destino
fr: Vue d'ensemble de la mise à l'échelle du cluster cible
ja: ターゲット クラスターのスケール概要
pt_br: Visão geral de escala de cluster de destino
ru: Обзор масштабирования целевого кластера

# bdc-create.clusterProfileLabel
source: Deployment profile
es: Perfil de implementación
fr: Profil de déploiement
ja: 展開プロファイル
pt_br: Perfil de implantação
ru: Профиль развертывания

# bdc-create.HardwareProfileText
source: Hardware profile
es: Perfil de hardware
fr: Profil matériel
ja: ハードウェア プロファイル
pt_br: Perfil de hardware
ru: Профиль оборудования

# bdc-create.HardwareLabelColumnName
source: Label
es: Etiqueta
fr: Étiquette
ja: ラベル
pt_br: Rótulo
ru: Этикетка

# bdc-create.TotalNodesColumnName
source: Nodes
es: Nodos
fr: Nœuds
ja: ノード
pt_br: Nós
ru: Узлы

# bdc-create.TotalCoresColumnName
source: Cores
es: Núcleos
fr: Cœurs
ja: コア
pt_br: Núcleos
ru: Ядра

# bdc-create.TotalMemoryColumnName
source: Memory
es: Memoria
fr: Mémoire
ja: メモリ
pt_br: Memória
ru: Память

# bdc-create.TotalDisksColumnName
source: Disks
es: Discos
fr: Disques
ja: ディスク
pt_br: Discos
ru: Диски

# bdc-create.ScaleLabel
source: Scale
es: Escala
fr: Échelle
ja: 小数点以下桁数
pt_br: Escala
ru: Масштаб

# bdc-create.HardwareProfileLabel
source: Hardware profile label
es: Etiqueta de Perfil de hardware
fr: Étiquette de profil matériel
ja: ハードウェア プロファイルのラベル
pt_br: Rótulo de perfil de hardware
ru: Метка профиля оборудования

# bdc-create.FeatureSetLabel
source: Feature set
es: Conjunto de características
fr: Ensemble de fonctionnalités
ja: 機能セット
pt_br: Conjunto de recursos
ru: Набор компонентов

# bdc-create.EngineOnlyText
source: Engine only
es: Solo el motor
fr: Moteur seulement
ja: エンジンのみ
pt_br: Somente mecanismo
ru: Только подсистема

# bdc-create.EngineWithFeaturesText
source: Engine with optional features
es: Motor con características opcionales
fr: Moteur avec fonctionnalités facultatives
ja: オプション機能が含まれるエンジン
pt_br: Motor com funcionalidades opcionais
ru: Подсистема с дополнительными компонентами

# bdc-create.SQLServerMasterDisplayName
source: SQL Server master
es: Servidor SQL Server maestro
fr: Serveur maître SQL Server
ja: SQL Server マスター
pt_br: SQL Server mestre
ru: База данных master SQL Server

# bdc-create.ComputePoolDisplayName
source: Compute pool
es: Grupo de proceso
fr: Pool de calcul
ja: コンピューティング プール
pt_br: Pool de Computação
ru: Пул вычислительных ресурсов

# bdc-create.DataPoolDisplayName
source: Data pool
es: Grupo de datos
fr: Pool de données
ja: データ プール
pt_br: Pool de dados
ru: Пул данных

# bdc-create.StoragePoolDisplayName
source: Storage pool
es: Grupo de almacenamiento
fr: Pool de stockage
ja: 記憶域プール
pt_br: Pool de armazenamento
ru: Пул носителей

# bdc-create.SparkPoolDisplayName
source: Spark pool
es: Grupo de Spark
fr: Pool Spark
ja: スパーク プール
pt_br: Pool do Spark
ru: Пул Spark

# bdc-create.SQLServerMasterDescription
source: The SQL Server instance provides an externally accessible TDS endpoint for the cluster
es: La instancia de SQL Server proporciona un punto de conexión TDS accesible desde el exterior para el clúster
fr: L'instance SQL Server fournit au cluster un point de terminaison TDS accessible en externe
ja: SQL Server インスタンスには、クラスター用の外部アクセス可能な TDS エンドポイントが備わっています
pt_br: A instância do SQL Server fornece um ponto de extremidade TDS acessível externamente para o cluster
ru: Экземпляр SQL Server предоставляет доступную извне конечную точку TDS для кластера

# bdc-create.ComputePoolDescription
source: TODO: Add description
es: TODO: Agregar descripción
fr: TODO : Ajouter une description
ja: TODO: 説明を追加します
pt_br: FAZER: Adicionar descrição
ru: TODO: добавление описания

# bdc-create.DataPoolDescription
source: TODO: Add description
es: TODO: Agregar Descripción
fr: TODO : Ajouter une description
ja: TODO: 説明を追加します
pt_br: TODO: Adicionar Descrição
ru: TODO: добавление описания

# bdc-create.StoragePoolDescription
source: TODO: Add description
es: TODO: Agregar descripción
fr: TODO : Ajouter une description
ja: TODO: 説明を追加します
pt_br: TODO: Adicionar Descrição
ru: TODO: добавление описания

# bdc-create.SparkPoolDescription
source: TODO: Add description
es: TODO: Agregar descripción
fr: TODO : Ajouter une description
ja: TODO: 説明を追加します
pt_br: TODO: Adicionar Descrição
ru: TODO: добавление описания

# bdc-create.wizardTitle
source: Create a big data cluster
es: Cree un clúster de macrodatos
fr: Créer un cluster Big Data
ja: ビッグ データ クラスターを作成します
pt_br: Criar um cluster de Big Data
ru: Создайте кластер больших данных

# bdc-create.generateScriptsButtonText
source: Generate Scripts
es: Generar scripts
fr: Générer des scripts
ja: スクリプトの生成
pt_br: Gerar Scripts
ru: Создать сценарии

# bdc-create.createClusterButtonText
source: Create
es: Crear
fr: Créer
ja: 作成
pt_br: Criar
ru: Создать

# bdc-create.AKSClusterCardText
source: New AKS Cluster
es: Nuevo clúster de AKS
fr: Nouveau Cluster AKS
ja: 新しい AKS クラスター
pt_br: Novo Cluster AKS
ru: Новый кластер AKS

# bdc-create.AKSClusterFullName
source: New Azure Kubernetes Service cluster
es: Nuevo clúster de Azure Kubernetes Service
fr: Nouveau cluster Azure Kubernetes Service
ja: 新しい Azure Kubernetes Service クラスター
pt_br: Novo cluster do Serviço de Kubernetes do Azure
ru: Новый кластер Службы Azure Kubernetes

# bdc-create.AKSClusterDescription
source: This option configures new Azure Kubernetes Service (AKS) for SQL Server big data cluster deployments. AKS makes it simple to create, configure and manage a cluster of virutal machines that are preconfigured with a Kubernetes cluster to run containerized applications.
es: Esta opción configura el nuevo Azure Kubernetes Service (AKS) para implementaciones de clústeres de macrodatos de SQL Server. AKS simplifica la creación, la configuración y la administración de un clúster de máquinas virtuales preconfiguradas con un clúster de Kubernetes para ejecutar aplicaciones en contenedores.
fr: Cette option configure le nouveau service Azure Kubernetes Service (AKS) pour les déploiements de cluster SQL Server Big Data. AKS simplifie la création, la configuration et la gestion d'un cluster de machines virtuelles préconfigurées avec un cluster Kubernetes pour exécuter des applications conteneurisées.
ja: このオプションは、SQL Server のビッグ データ クラスター展開用の新しい Azure Kubernetes Service (AKS) を構成します。AKS を使用すると、コンテナー化されたアプリケーションを実行するための、Kubernetes クラスターで事前構成された仮想マシンのクラスターを簡単に作成、構成、管理できます。
pt_br: Esta opção configura um novo AKS (Serviço de Kubernetes do Azure) para implantações de cluster de Big Data do SQL Server. O AKS torna simples criar, configurar e gerenciar um cluster de máquinas virtuais que são pré-configuradas com um cluster do Kubernetes para executar aplicativos em contêineres.
ru: Этот параметр настраивает новую службу Azure Kubernetes (AKS) для развертываний кластера больших данных SQL Server. AKS упрощает создание, настройку и использование кластера виртуальных машин, для которых предварительно настроен кластер Kubernetes для запуска контейнерных приложений.

# bdc-create.ExistingClusterCardText
source: Existing Cluster
es: Clúster existente
fr: Cluster existant
ja: 既存のクラスター
pt_br: Cluster existente
ru: Существующий кластер

# bdc-create.ExistingClusterFullName
source: Existing Kubernetes cluster
es: Clúster de Kubernetes existente
fr: Cluster Kubernetes existant
ja: 既存の Kubernetes クラスター
pt_br: Cluster de Kubernetes existente
ru: Существующий кластер Kubernetes

# bdc-create.ExistingClusterDescription
source: This option assumes you already have a Kubernetes cluster installed, Once a prerequisite check is done, ensure the correct cluster context is selected.
es: Esta opción supone que ya tiene instalado un clúster de Kubernetes. Una vez que se realice una comprobación de requisitos previos, asegúrese de seleccionar el contexto de clúster correcto.
fr: Cette option suppose que vous avez déjà installé un cluster Kubernetes. Une fois que vous avez effectué la vérification des prérequis, vérifiez que le contexte de cluster approprié est sélectionné.
ja: このオプションは、既に Kubernetes クラスターがインストールされていることが前提です。前提条件の確認が済んだら、適切なクラスター コンテキストを選択してください。
pt_br: Esta opção pressupõe que você já tem um cluster Kubernetes instalado. Após a realização de uma verificação de pré-requisitos, confirme que o contexto correto do cluster seja selecionado.
ru: Этот параметр предполагает, что вы уже установили кластер Kubernetes. После проверки предварительных требований выберите правильный контекст кластера.
