Repository: robertcrockett/azuredatastudio_1_8
Catalog: resources/xlf/vscode-extensions/dacpac.*.xlf
Languages: fr, zh_hans

# dacFx.deployRadioButtonLabel
source: Deploy a data-tier application .dacpac file to an instance of SQL Server [Deploy Dacpac]
fr: Déployer un fichier .dacpac d'application de couche Données sur une instance de SQL Server [Déployer Dacpac]
zh_hans: 将数据层应用程序 .dacpac 文件部署到 SQL Server 的实例 [部署 Dacpac]

# dacFx.extractRadioButtonLabel
source: Extract a data-tier application from an instance of SQL Server to a .dacpac file [Extract Dacpac]
fr: Extraire une application de couche Données d'une instance de SQL Server vers un fichier .dacpac [Extraire Dacpac]
zh_hans: 将数据层应用程序从 SQL Server 实例提取到 .dacpac 文件 [提取 Dacpac]

# dacFx.importRadioButtonLabel
source: Create a database from a .bacpac file [Import Bacpac]
fr: Créer une base de données à partir d'un fichier .bacpac [Importer Bacpac]
zh_hans: 基于 .bacpac 文件创建数据库 [导入 Bacpac]

# dacFx.exportRadioButtonLabel
source: Export the schema and data from a database to the logical .bacpac file format [Export Bacpac]
fr: Exporter le schéma et les données d'une base de données au format de fichier logique .bacpac [Exporter Bacpac]
zh_hans: 将架构和数据从数据库导出到逻辑 .bacpac 文件格式 [导出 Bacpac]

# dacFxImport.openFile
source: Open
fr: Ouvrir
zh_hans: 打开

# dacFxImport.fileTextboxTitle
source: File Location
fr: Emplacement du fichier
zh_hans: 文件位置

# dacfxExtract.saveFile
source: Save
fr: Enregistrer
zh_hans: 保存

# dacFxExtract.fileTextboxTitle
source: File Location
fr: Emplacement du fichier
zh_hans: 文件位置

# dacFxExtract.versionTextboxTitle
source: Version (use x.x.x.x where x is a number)
fr: Version (utiliser x.x.x.x où x est un nombre)
zh_hans: 版本(采用 x.x.x.x 格式，x 表示数字)

# dacfxExport.saveFile
source: Save
fr: Enregistrer
zh_hans: 保存

# dacFxExport.fileTextboxTitle
source: File Location
fr: Emplacement du fichier
zh_hans: 文件位置

# dacfx.dataLossTextWithCount
source: {0} of the deploy actions listed may result in data loss. Please ensure you have a backup or snapshot available in the event of an issue with the deployment.
fr: {0} des actions de déploiement listées peuvent entraîner une perte de données. Vérifiez que vous avez une sauvegarde ou un instantané disponible en cas de problème avec le déploiement.
zh_hans: 列出的部署操作的 {0} 可能会导致数据丢失。请确保在部署出现问题的情况下，你有备份或快照可用。

# dacFx.dataLossCheckbox
source: Proceed despite possible data loss
fr: Poursuivre malgré le risque de perte de données
zh_hans: 尽管可能会丢失数据，仍要继续

# dacfx.noDataLossText
source: No data loss will occur from the listed deploy actions.
fr: Aucune perte de données suite aux actions de déploiement listées.
zh_hans: 列出的部署操作不会导致数据丢失。

# dacfx.dataLossText
source: The deploy actions may result in data loss. Please ensure you have a backup or snapshot available in the event of an issue with the deployment.
fr: Les actions de déploiement peuvent entraîner une perte de données. Vérifiez que vous avez une sauvegarde ou un instantané disponible en cas de problème avec le déploiement.
zh_hans: 部署操作可能会导致数据丢失。请确保在部署出现问题的情况下，你有备份或快照可用。

# dacfx.operationColumn
source: Operation
fr: Opération
zh_hans: 操作

# dacfx.operationTooltip
source: Operation(Create, Alter, Delete) that will occur during deployment
fr: Opération (Créer, Modifier, Supprimer) qui a lieu pendant le déploiement
zh_hans: 部署过程中将发生的操作(创建、更改、删除)

# dacfx.typeColumn
source: Type
zh_hans: 类型

# dacfx.typeTooltip
source: Type of object that will be affected by deployment
fr: Type d'objet affecté par le déploiement
zh_hans: 将受部署影响的对象类型

# dacfx.objectColumn
source: Object
fr: Objet
zh_hans: 对象

# dacfx.objecTooltip
source: Name of object that will be affected by deployment
fr: Nom d'objet affecté par le déploiement
zh_hans: 将受部署影响的对象的名称

# dacfx.dataLossColumn
source: Data Loss
fr: Perte de données
zh_hans: 数据丢失

# dacfx.dataLossTooltip
source: Operations that may result in data loss are marked with a warning sign
fr: Les opérations pouvant entraîner une perte des données sont marquées avec un signe d'avertissement
zh_hans: 将对可能导致数据丢失的操作标记警告符号

# dacFx.databaseNameTextBox
source: Database Name
fr: Nom de la base de données
zh_hans: 数据库名称

# dacFx.databaseNameDropdown
source: Database Name
fr: Nom de la base de données
zh_hans: 数据库名称

# dacFxDeploy.openFile
source: Open
fr: Ouvrir
zh_hans: 打开

# dacFxDeploy.fileTextboxTitle
source: File Location
fr: Emplacement du fichier
zh_hans: 文件位置

# dacFx.upgradeRadioButtonLabel
source: Upgrade Existing Database
fr: Mettre à niveau la base de données existante
zh_hans: 升级现有数据库

# dacFx.newRadioButtonLabel
source: New Database
fr: Nouvelle base de données
zh_hans: 新数据库

# dacFx.targetDatabaseRadioButtonsTitle
source: Target Database
fr: Base de données cible
zh_hans: 目标数据库

# dacFx.targetDatabaseDropdownTitle
source: Database Name
fr: Nom de la base de données
zh_hans: 数据库名称

# dacFx.deployRadioButtonLabel
source: Deploy
fr: Déployer
zh_hans: 部署

# dacFx.deployScriptRadioButtonLabel
source: Generate Deployment Script and Deploy
fr: Générer le script de déploiement et déployer
zh_hans: 生成部署脚本并进行部署

# dacFx.scriptRadioButtonLabel
source: Generate Deployment Script
fr: Générer un script de déploiement
zh_hans: 生成部署脚本

# dacfxDeployScript.saveFile
source: Save
fr: Enregistrer
zh_hans: 保存

# dacfx.generatedScriptLocation
source: Deployment Script Location
fr: Emplacement du script de déploiement
zh_hans: 部署脚本位置

# dacfx.targetServerName
source: Target Server
fr: Serveur cible
zh_hans: 目标服务器

# dacfx.targetDatabaseName
source: Target Database
fr: Base de données cible
zh_hans: 目标数据库

# dacfx.sourceServerName
source: Source Server
fr: Serveur source
zh_hans: 源服务器

# dacfx.sourceDatabaseName
source: Source Database
fr: Base de données source
zh_hans: 源数据库

# dacfx.fileLocation
source: File Location
fr: Emplacement du fichier
zh_hans: 文件位置

# dacfx.scriptLocation
source: Deployment Script Location
fr: Emplacement du script de déploiement
zh_hans: 部署脚本位置

# dacfx.action
source: Action
zh_hans: 操作

# dacfx.deploy
source: Deploy
fr: Déployer
zh_hans: 部署

# dacfx.generateScript
source: Generate Deployment Script
fr: Générer un script de déploiement
zh_hans: 生成部署脚本

# dacfxExtract.version
source: Version
zh_hans: 版本

# dacfx.settingColumn
source: Setting
fr: Paramètre
zh_hans: 设置

# dacfx.valueColumn
source: Value
fr: Valeur
zh_hans: 值

# dacFx.targetServerDropdownTitle
source: Target Server
fr: Serveur cible
zh_hans: 目标服务器

# dacFx.sourceServerDropdownTitle
source: Source Server
fr: Serveur source
zh_hans: 源服务器

# dacFx.databaseNameTextBox
source: Target Database
fr: Base de données cible
zh_hans: 目标数据库

# dacFx.sourceDatabaseDropdownTitle
source: Source Database
fr: Base de données source
zh_hans: 源数据库

# dacfx.needConnection
source: Please connect to a server before using this wizard.
fr: Connectez-vous à un serveur avant d’utiliser cet Assistant.
zh_hans: 请在使用此向导之前连接到服务器。

# dacFx.selectOperationPageName
source: Select an Operation
fr: Sélectionner une opération
zh_hans: 选择操作

# dacFx.deployConfigPageName
source: Select Deploy Dacpac Settings
fr: Sélectionner les paramètres de déploiement Dacpac
zh_hans: 选择“部署 Dacpac 设置”

# dacFx.deployPlanPage
source: Review the deploy plan
fr: Examiner le plan de déploiement
zh_hans: 查看部署计划

# dacFx.deployActionPageName
source: Select Action
fr: Sélectionner une action
zh_hans: 选择操作

# dacFx.summaryPageName
source: Summary
fr: Récapitulatif
zh_hans: 摘要

# dacFx.extractConfigPageName
source: Select Extract Dacpac Settings
fr: Sélectionner les paramètres d'extraction Dacpac
zh_hans: 选择“提取 Dacpac 设置”

# dacFx.importConfigPageName
source: Select Import Bacpac Settings
fr: Sélectionner les paramètres d'importation Bacpac
zh_hans: 选择“导入 Bacpac 设置”

# dacFx.exportConfigPageName
source: Select Export Bacpac Settings
fr: Sélectionner les paramètres d'exportation Bacpac
zh_hans: 选择“导出 Bacpac 设置”

# dacFx.deployButton
source: Deploy
fr: Déployer
zh_hans: 部署

# dacFx.extractButton
source: Extract
fr: Extraire
zh_hans: 提取

# dacFx.importButton
source: Import
fr: Importer
zh_hans: 导入

# dacFx.exportButton
source: Export
fr: Exporter
zh_hans: 导出

# dacFx.generateScriptButton
source: Generate Script
fr: Générer le script
zh_hans: 生成脚本

# alertData.deployErrorMessage
source: Deploy failed '{0}'
fr: Échec du déploiement '{0}'
zh_hans: 部署失败的“{0}”

# alertData.extractErrorMessage
source: Extract failed '{0}'
fr: Échec de l'extraction '{0}'
zh_hans: 提取失败的“{0}”

# alertData.exportErrorMessage
source: Export failed '{0}'
fr: Échec de l'exportation '{0}'
zh_hans: 导出失败的“{0}”

# alertData.importErrorMessage
source: Import failed '{0}'
fr: Échec de l'importation '{0}'
zh_hans: 导入失败的“{0}”

# dacfx.scriptGeneratingMessage
source: You can view the status of script generation in the Task History once the wizard is closed
fr: Vous pouvez voir l'état de la génération du script dans l'historique des tâches une fois l'Assistant fermé
zh_hans: 向导关闭后，可在“任务历史记录”中查看脚本生成的状态

# alertData.deployPlanErrorMessage
source: Generating deploy plan failed '{0}'
fr: La génération du plan de déploiement a échoué '{0}'
zh_hans: 部署计划生成失败“{0}”
